In [7]:
import os, sys

module_path = os.path.abspath(os.path.join('../..'))
if module_path not in sys.path:
    sys.path.append(module_path)
    
import guacml as guac
import imp
imp.reload(guac)
None

In [2]:
ds = guac.Dataset('./data/raw/train.csv', 'Survived')
ds.df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
ds.analyze_columns()

,col_name,type,n_unique,n_unique_%,n_na_%,n_blank_%,example
0,PassengerId,ColType.ID,891,100,0.0,0,1
1,Survived,ColType.BINARY,2,0,0.0,0,0
2,Pclass,ColType.CATEGORICAL,3,0,0.0,0,3
3,Name,ColType.WORDS,891,100,0.0,0,"Braund, Mr. Owen Harris"
4,Sex,ColType.CATEGORICAL,2,0,0.0,0,male
5,Age,ColType.NUMERIC,88,10,20.0,0,22
6,SibSp,ColType.ORDINAL,7,1,0.0,0,1
7,Parch,ColType.CATEGORICAL,7,1,0.0,0,0
8,Ticket,ColType.CATEGORICAL,681,76,0.0,0,A/5 21171
9,Fare,ColType.NUMERIC,248,28,0.0,0,7.25
10,Cabin,ColType.CATEGORICAL,147,16,77.0,0,C85
11,Embarked,ColType.CATEGORICAL,3,0,0.0,0,S